/** @jsx jsx */
import { jsx } from '@emotion/core';
import HotlineTable, { Hotline, HotlineType } from '../components/HotlineTable';

export default () => {
  return (
    <div className={'container'}>
      <h1>สายด่วน</h1>

      <HotlineTable items={hotlineList} />
    </div>
  );
}

const hotlineList: Hotline[] = [
  {
    name: 'โรงพยาบาลศิริราช', tel: '02-411-4230-44', type: 0
  },
  {
    name: 'โรงพยาบาลจุฬาลงกรณ์', tel: '02-252-8131-9', type: 0
  },
  {
    name: 'โรงพยาบาลเจริญกรุงประชารักษ์', tel: '02-289-7000-3', type: 0
  },
  {
    name: 'โรงพยาบาลราชวิถี', tel: '02-248-3213-4', type: 0
  },
  {
    name: 'โรงพยาบาลหัวเฉียว', tel: '02-223-1351', type: 0
  },
  {
    name: 'โรงพยาบาลวิชัยเวช อินเตอร์เนชั่นแนล หนองแขม', tel: '02-807-4044', type: 0
  },
  {
    name: 'สถาบันการแพทย์ฉุกเฉินแห่งชาติ', tel: '1669', type: 1
  },
  {
    name: 'หน่วยแพทย์กู้ชีวิตวชิรพยาบาล', tel: '1554', type: 1
  },
  {
    name: 'ศูนย์เอราวัณสำนักแพทย์', tel: '1646', type: 1
  },
  {
    name: 'มูลนิธิป่อเต็กตึ๊ง(ศูนย์วิทยุกรุงเทพฯ)', tel: '02-226-4444 และ 1418', type: 1
  },
  {
    name: 'ศูนย์วิทยุอปพร.ตลิ่งชัน', tel: '02-424-1381', type: 1
  },
  {
    name: 'มูลนิธิร่วมกตัญญู', tel: '02-751-0951-3', type: 1
  },
  {
    name: 'มูลนิธิกู้ภัยร่มไทร(มีนบุรี)', tel: '02-918-6660', type: 1
  },
  {
    name: 'มูลนิธิอาสาหนองจอกศูนย์ราชพฤกษ์', tel: '02-988-3333', type: 1
  },
  {
    name: 'มูลินิธิร่วมกุศลสมุทรปราการ (เทียนเต๊กตึ้ง)', tel: '02-175-8668', type: 1
  },
  {
    name: 'iLaw', tel: '02-002-7878', type: 2
  },
  {
    name: 'ศูนย์ทนายความเพื่อสิทธิมนุษยชน', tel: '092-217-3172 และ 096-789-3173', type: 2
  },
  {
    name: 'ศูนย์อำนวยการกฎหมายพรรคเพื่อไทย', tel: '02-653-4050, 02-653-4051 และ 02-653-4052', type: 2
  },
  {
    name: 'ศูนย์ประชาบดีแจ้งคนหาย', tel: '1300', type: 3
  },
  {
    name: 'มูลนิธิกระจกเงา', tel: '02-973-22367', type: 3
  },
  {
    name: 'โรงพยาบาลเซ็นทรัล เยอเนรัล', tel: '02-552-8777', type: 0
  },
  {
    name: 'โรงพยาบาลวิภาวดี', tel: '02-941-2800', type: 0
  },
  {
    name: 'โรงพยาบาล เมโย', tel: '02-579-1770-4', type: 0
  },
  {
    name: 'โรงพยาบาลสินแพทย์', tel: '02-948-5380', type: 0
  },
  {
    name: 'โรงพยาบาลบางโพ', tel: '02-587-0144', type: 0
  },
  {
    name: 'โรงพยาบาลเปาโล เมโมเรียล โชคชัย 4', tel: '02-514-2157-9', type: 0
  },
  {
    name: 'โรงพยาบาลเปาโลเมโมเรียล นวมินทร์ (เดิม)', tel: '02-279-7000', type: 0
  },
  {
    name: 'สถานพยาบาลผู้ป่วยเรื้อรังสุทธิสาร', tel: '02-275-6351-5', type: 0
  },
  {
    name: 'โรงพยาบาลธนบุรี 2', tel: '02-448-3845', type: 0
  },
  {
    name: 'สถานพยาบาลผู้ป่วยเรื้อรัง วิชัยยุทธ', tel: '02-618-6200', type: 0
  },
  {
    name: 'โรงพยาบาลเจ้าพระยา', tel: '02-434-0117', type: 0
  },
  {
    name: 'โรงพยาบาลเวชธานี', tel: '02-734-0000', type: 0
  },
  {
    name: 'โรงพยาบาลพญาไท 2', tel: '02-617-2444', type: 0
  },
  {
    name: 'โรงพยาบาลรามคำแหง', tel: '02-374-020016', type: 0
  },
  {
    name: 'โรงพยาบาลมิชชั่น', tel: '02-282-1100', type: 0
  },
  {
    name: 'โรงพยาบาลเดชา', tel: '02-246-0137', type: 0
  },
  {
    name: 'โรงพยาบาลพญาไท 1', tel: '02-640-1111', type: 0
  },
  {
    name: 'โรงพยาบาลพระราม 9', tel: '02-248-8020', type: 0
  },
  {
    name: 'โรงพยาบาลปิยะเวท', tel: '02-641-4499', type: 0
  },
  {
    name: 'โรงพยาบาลธนบุรี', tel: '02-412-0020', type: 0
  },
  {
    name: 'โรงพยาบาลกรุงเทพ', tel: '02-310-3000', type: 0
  },
  {
    name: 'โรงพยาบาลจักษุรัตนิน', tel: '02-258-0442', type: 0
  },
  {
    name: 'โรงพยาบาลบำรุงราษฎร์', tel: '02-667-1000', type: 0
  },
  {
    name: 'โรงพยาบาลแพทย์ปัญญา', tel: '02-314-0726-9', type: 0
  },
  {
    name: 'โรงพยาบาล เพชรเวช', tel: '02-718-1515', type: 0
  },
  {
    name: 'โรงพยาบาลคลองตัน', tel: '02-319-2101-5', type: 0
  },
  {
    name: 'โรงพยาบาลกว๋องสิวมูลนิธิ', tel: '02-221-8487', type: 0
  },
  {
    name: 'โรงพยาบาลคามิลเลียน', tel: '02-391-5724', type: 0
  },
  {
    name: 'โรงพยาบาลเทียนฟ้ามูลนิธิ(แผนปัจจุบัน)', tel: '02-233-0955', type: 0
  },
  {
    name: 'โรงพยาบาลสมิติเวช', tel: '02-392-0011', type: 0
  },
  {
    name: 'โรงพยาบาลนันอา', tel: '02-948-5380', type: 0
  },
  {
    name: 'โรงพยาบาลกรุงเทพคริสเตียน', tel: '02-233-6819', type: 0
  },
  {
    name: 'โรงพยาบาลมเหสักข์', tel: '02-635-7123', type: 0
  },
  {
    name: 'โรงพยาบาลบางไผ่', tel: '02-457-00086', type: 0
  },
  {
    name: 'โรงพยาบาลบี เอ็น เอช', tel: '02-686-2700', type: 0
  },
  {
    name: 'โรงพยาบาลสุขุมวิท', tel: '02-391-0011', type: 0
  },
  {
    name: 'โรงพยาบาลเยาวรักษ์', tel: '02-465-5620-2', type: 0
  },
  {
    name: 'โรงพยาบาลเซ็นต์หลุยส์', tel: '026755000', type: 0
  },
  {
    name: 'โรงพยาบาลเทพธารินทร์', tel: '02-240-2727', type: 0
  },
  {
    name: 'โรงพยาบาลกรุงธน 1', tel: '02-438-0040-5', type: 0
  },
  {
    name: 'โรงพยาบาลเกษมราษฏร์บางแค', tel: '02-804-8959', type: 0
  },
  {
    name: 'สถานพยาบาลเพชรเกษม - บางแค', tel: '02-801-1199', type: 0
  },
  {
    name: 'โรงพยาบาลบางปะกอก 1', tel: '02-872-1111', type: 0
  },
  {
    name: 'โรงพยาบาลราษฏร์บูรณะ', tel: '02-427-0175-9', type: 0
  },
  {
    name: 'โรงพยาบาลบางมด', tel: '02-867-0606', type: 0
  },
  {
    name: 'โรงพยาบาลนครธน', tel: '02-416-5454', type: 0
  },
  {
    name: 'โรงพยาบาลศิครินทร์', tel: '02-383-4400', type: 0
  },
  {
    name: 'โรงพยาบาลพระราม 2', tel: '02-451-4920-30', type: 0
  },
  {
    name: 'โรงพยาบาลนวมินทร์ 2', tel: '02-427-1616', type: 0
  },
  {
    name: 'สถานพยาบาลผู้ป่วยเรื้องรังกล้วยน้ำไท2', tel: '02-769-2000', type: 0
  },
  {
    name: 'โรงพยาบาลเกษมราษฎร์ สุขาภิบาล 3', tel: '02-729300', type: 0
  },
  {
    name: 'โรงพยาบาลเกษมราษฎร์ประชาชื่น', tel: '02-910-1600', type: 0
  },
  {
    name: 'โรงพยาบาลโกลเด้นเยียร์', tel: '02-6930733-40', type: 0
  },
  {
    name: 'โรงพยาบาลเจตนิน', tel: '02-655-5300', type: 0
  },
  {
    name: 'สถานพยาบาลเดอะซีเนียร์', tel: '02-511-0303', type: 0
  },
  {
    name: 'โรงพยาบาลตา หู คอ จมูก', tel: '02-886-6600', type: 0
  },
  {
    name: 'โรงพยาบาลนวมินทร์', tel: '02-918-5080', type: 0
  },
  {
    name: 'โรงพยาบาลไทยนครินทร์', tel: '02-361-2828', type: 0
  },
  {
    name: 'โรงพยาบาลบางนา 1', tel: '02-725-9595', type: 0
  },
  {
    name: 'โรงพยาบาลนวศรีเนอสซิ่งโฮม', tel: '02-718-4866-7', type: 0
  },
  {
    name: 'สถานพยาบาลบางขุนเทียน', tel: '02-477-2290-3', type: 0
  },
  {
    name: 'โรงพยาบาลพญาไท 3', tel: '02-4671111', type: 0
  },
  {
    name: 'โรงพยาบาลยันฮี', tel: '02-879-0300', type: 0
  },
  {
    name: 'โรงพยาบาลสมิติเวชศรีนครินทร์', tel: '02-378-9000', type: 0
  },
  {
    name: 'โรงพยาบาลบี.แคร์.เมดิคอลเซ็นเตอร์', tel: '02-523-3359-71', type: 0
  },
  {
    name: 'โรงพยาบาลรัชดา-ท่าพระ', tel: '02-466-0205', type: 0
  },
  {
    name: 'สถานพยาบาลศุขเวชเนอสซิ่งโฮม (ราม 21)', tel: '02-319-5865', type: 0
  },
  {
    name: 'สถานพยาบาลภัสรพิบาลเนอสซิ่งโฮม', tel: '02-718-48667', type: 0
  },
  {
    name: 'สถานพยาบาล เดอะซีเนียร์ 3', tel: '02-511-0303', type: 0
  },
  {
    name: 'โรงพยาบาลบางปะกอก 9 อินเตอร์เนชั่นแนล', tel: '02-2877-1111', type: 0
  },
  {
    name: 'สถานพยาบาลพระราม 3', tel: '02-689-8888', type: 0
  },
  {
    name: 'โรงพยาบาลบางปะกอก 8', tel: '02-8944-4111', type: 0
  },
  {
    name: 'สถานพยาบาลเวชกรรมบางปะกอก 2', tel: '02-899-0130', type: 0
  },
  {
    name: 'โรงพยาบาลเฉพาะทางศัลยกรรมตกแต่งกมล', tel: '02-559-0151-5', type: 0
  },
  {
    name: 'โรงพยาบาลสายไหม', tel: '02-991-8999', type: 0
  },
  {
    name: 'โรงพยาบาลวัฒโนสถ', tel: '02-310-3000', type: 0
  },
  {
    name: 'สถานพยาบาลเวชกรรม กรุงเทพอินเตอร์เนชั่นแนล', tel: '02-310-3227', type: 0
  },
  {
    name: 'โรงพยาบาลลาดพร้าว', tel: '02-530-2556-69', type: 0
  },
  {
    name: 'โรงพยาบาลการแพทย์วิชัยยุทธ', tel: '02-265-7777', type: 0
  },
  {
    name: 'สถานพยาบาลบางมด 3', tel: '02-416-8561-2', type: 0
  },
  {
    name: 'โรงพยาบาลมนารมย์', tel: '02-725-9595', type: 0
  },
  {
    name: 'สถานพยาบาลผู้ป่วยเรื้อรังเดอะซีเนียร์ 3', tel: '02-930-0020', type: 0
  },
  {
    name: 'โรงพยาบาลศรีวิชัย', tel: '02-412-0055', type: 0
  },
  {
    name: 'สถานพยาบาลมะเร็งกรุงเทพ', tel: '02-785-716-21', type: 0
  },
  {
    name: 'โรงพยาบาลกล้วยน้ำไท', tel: '02-381-2006-20', type: 0
  },
  {
    name: 'สถานพยาบาลเวชกรรมเฉพาะทางอาชีวเวชศาสตร์อินเตอรเมด', tel: '02-865-0044-8', type: 0
  },
  {
    name: 'โรงพยาบาลเสรีรักษ์', tel: '02-918-9888', type: 0
  },
  {
    name: 'โรงพยาบาลกรุงธน 2', tel: '02-428-0367', type: 0
  },
  {
    name: 'โรงพยาบาลวิภาราม', tel: '02-722-2500-24', type: 0
  },
  {
    name: 'สถานพยาบาลชินเขตงามวงศ์วาน', tel: '02-580-7426-9', type: 0
  },
  {
    name: 'โรงพยาบาลหัวใจกรุงเทพฯ', tel: '02-310-3000', type: 0
  },
  {
    name: 'โรงพยาบาลเปาโล เมโมเรียบ นวมินทร์', tel: '02-944-8015-20', type: 0
  },
  {
    name: 'โรงพยาบาลวิชัยยุทธ', tel: '02-618-6200', type: 0
  },
  {
    name: 'โรงพยาบาลนวมินทร์ 9', tel: '02-518-1818', type: 0
  },
  {
    name: 'โรงพยาบาลภูมิพลอดุลยเดช', tel: '02-534-7000', type: 0
  },
  {
    name: 'โรงพยาบาลและสถาบันประสาทวิทยา', tel: '02-246-9254', type: 0
  },
  {
    name: 'โรงพยาบาลพระมงกุฏเกล้า', tel: '02-246-1400-28', type: 0
  },
  {
    name: 'โรงพยาบาลสงฆ์', tel: '02-247-1655', type: 0
  },
  {
    name: 'สถาบันกัลยาณ์ราชนครินทร(นิติจิตเวช)', tel: '02-889-9066-7', type: 0
  },
  {
    name: 'โรงพยาบาลราชานุกูล', tel: '02-245-4601-4', type: 0
  },
  {
    name: 'โรงพยาบาลบุรฉัตรไชยากร (รถไฟ)', tel: '02-245-2480', type: 0
  },
  {
    name: 'โรงพยาบาลตำรวจ', tel: '02-252-8111', type: 0
  },
  {
    name: 'โรงพยาบาลสมเด็จเจ้าพระยา', tel: '02-437-0200-08', type: 0
  },
  {
    name: 'โรงพยาบาลเลิดสิน', tel: '02-353-9799', type: 0
  },
  {
    name: 'โรงพยาบาลโรงงานยาสูบ', tel: '02-656-4500', type: 0
  },
  {
    name: 'โรงพยาบาลนพรัตน์ราชธานี', tel: '02-517-4270-9', type: 0
  },
  {
    name: 'โรงพยาบาลสมเด็จพระปิ่นเกล้า', tel: '02-468-0116-20', type: 0
  },
  {
    name: 'โรงพยาบาลรามาธิบดี', tel: '02-588-3101-3', type: 0
  },
  {
    name: 'โรงพยาบาลทหารผ่านศึก', tel: '02-245-0661', type: 0
  },
  {
    name: 'สถาบันโรคผิวหนัง', tel: '02-246-1462', type: 0
  },
  {
    name: 'โรงพยาบาลโรคปอดกรุงเทพ', tel: '02-278-0463', type: 0
  },
  {
    name: 'โรงพยาบาลทหารเรือกรุงเทพ', tel: '02-411-2191', type: 0
  },
  {
    name: 'สถาบันมะเร็งแห่งชาติ', tel: '02-246-1463', type: 0
  },
  {
    name: 'สถาบันสุขภาพเด็กแห่งชาติมหาราชินี', tel: '02-245-7198', type: 0
  },
  {
    name: 'โรงพยาบาลเวฃศาสตร์เขตร้อน', tel: '02-246-1273', type: 0
  },
  {
    name: 'กองการแพทย์การท่าเรือแห่งประเทศไทย', tel: '02-269-3000', type: 0
  },
  {
    name: 'โรงพยาบาลแม่และเด็ก', tel: '02-521-3064', type: 0
  },
  {
    name: 'โรงพยาบาลคณะทันตแพทย์ศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย', tel: '02-218-8705', type: 0
  },
  {
    name: 'โรงพยาบาลนวุติสมเด็จย่า', tel: '02-279-8250-9', type: 0
  },
  {
    name: 'โรงพยาบาลกรมสรรพวุธทหารเรือ', tel: '02-393-5392', type: 0
  },
  {
    name: 'โรงพยาบาลเวชการุณรัศมิ์', tel: '02-548-1555', type: 0
  },
  {
    name: 'โรงพยาบาลกลาง', tel: '02-220-8000', type: 0
  },
  {
    name: 'โรงพยาบาลตากสิน', tel: '02-437-0123', type: 0
  },
  {
    name: 'โรงพยาบาลลาดกระบัง กรุงเทพมหานคร', tel: '02-326-9995', type: 0
  },
  {
    name: 'โรงพยาบาลหลวงพ่อทวีศักด์ ชุตินธโร อุทิศ', tel: '02-429-3575-81', type: 0
  },
  {
    name: 'โรงพยาบาลราชพิพัฒน์', tel: '02-421-2220', type: 0
  },
  {
    name: 'โรงพยาบาลสิรินธร', tel: '02-328-6900', type: 0
  }
];
